Aesop_Services_Scripts/absence_test/absenceAPI_smoke.yml
execution:
#- executor: jmeter
- concurrency: 50
  ramp-up: 50s
  iterations: 100
  scenario: Assign_Absence_Substitutes

scenarios:
  Assign_Absence_Substitutes:
    script: Assign_Absence_Substitutes.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed